new Vue({
	el : '#app',
	data : {
		input_text : 'Миля, ты тут?',
		output_text : '',
		show_params : false,
		symbols : {
			'А' : {
				selected : 'Ắ',
				options : ['Ꭿ','₳','Ǻ','ǻ','α','ά','Ǡ','ẫ','Ắ','ắ','Ằ','ằ','ẳ','Ẵ','ẵ','Ä','ª','ä','Å','À','Á','Â','å','ã','â','à','á','Ã','ᗩ','@','Ⱥ','Ǟ']
			},
			'Б' : {
				selected : 'Ҕ',
				options : ['Ҕ','ҕ','Ϭ','ϭ','চ','ঢ়','ƃ','ɓ']
			},
			'В' : {
				selected : 'ℬ',
				options : ['ℬ','Ᏸ','β','฿','ß','ᗷ','ᗽ','ᗾ','ᗿ','Ɓ','Ᏸ','ᗸ','ᗹ','ᛔ']
			},
			'Г' : {
				selected : 'ℾ',
				options : ['୮','┍','ℾ']
			},
			'Д' : {
				selected : 'ℊ',
				options : ['ℊ','∂']
			},
			'Е' : {
				selected : 'ℰ',
				options : ['ℰ','ℯ','ໂ','६','Ē','℮','ē','Ė','ė','Ę','ě','Ě','ę','Έ','ê','Ê','È','€','É','Ế','Ề','Ể','Ễ','é','è','Є','є','έ','ε','Ҿ','ҿ']
			},
			'Ж' : {
				selected : 'ᛤ',
				options : ['ᛤ','♅','Җ','җ','Ӝ','ӝ','Ӂ','ӂ']
			},
			'З' : {
				selected : 'Յ',
				options : ['Յ','ℨ','ჳ']
			},
			'И' : {
				selected : 'น',
				options : ['น','ự','Ӥ','ӥ']
			},
			'Й' : {
				selected : 'Ũ',
				options : ['Ũ','ũ','Ū','ū','Ŭ','ŭ','Ù','ú','Ú','ù','Ҋ','ҋ']
			},
			'К' : {
				selected : '₭',
				options : ['ᛕ','₭','Ꮶ','Ќ','k','ќ','ķ','Ķ','Ҝ','ҝ','ᶄ','Ҡ','ҡ']
			},
			'Л' : {
				selected : 'ለ',
				options : ['ለ','ሉ','ሊ','ሌ','ል','ሎ','Ꮧ','Ꮑ']
			},
			'М' : {
				selected : 'ጠ',
				options : ['ጠ','ᛖ','ℳ','ʍ','ᶆ','Ḿ','ḿ','♍','ᗰ','ᙢ','爪','♏','₥']
			},
			'Н' : {
				selected : 'ਮ',
				options : ['ਮ','ዘ','ዙ','ዚ','ዛ','ዜ','ዝ','ዞ','ዟ','ℍ','ℋ','ℎ','ℌ','ℏ','ዙ','Ꮵ','Ĥ','Ħ','Ή','Ḩ','Ӈ','ӈ']
			},
			'О' : {
				selected : 'ტ',
				options : ['০','ℴ','ტ','٥','Ό','ó','ό','σ','ǿ','Ǿ','Θ','ò','Ó','Ò','Ô','ô','Ö','ö','Õ','õ','ờ','ớ','ọ','Ọ','ợ','Ợ','ø','Ø','Ό','Ở','Ờ','Ớ','Ổ','ổ','Ợ','Ō','ō','Ő','ő','Ӫ','ӫ']
			},
			'П' : {
				selected : 'Ո',
				options : ['Ո','ग','ກ','⋒','Ҧ','ҧ']
			},
			'Р' : {
				selected : 'թ',
				options : ['թ','ℙ','℘','ρ','Ꭾ','Ꮅ','尸','Ҏ','ҏ','ᶈ','₱','☧','ᖘ','ק','₽','Ƿ','Ҏ','ҏ']
			},
			'С' : {
				selected : 'Ⴚ',
				options : ['Ⴚ','☾','ℭ','ℂ','Ç','¢','ç','Č','ċ','Ċ','ĉ','ς','Ĉ','ć','Ć','č','Ḉ','ḉ','⊂','Ꮸ','₡','¢']
			},
			'Т' : {
				selected : '⍑',
				options : ['⍑','⍡','T','t','τ','Ţ','Ť','Ŧ','Ṫ','₮']
			},
			'У' : {
				selected : 'ɣ',
				options : ['ɣ','Ꭹ','Ꮍ','Ẏ','ẏ','ϒ','ɤ','￥','௶','Ⴘ']
			},
			'Ф' : {
				selected : 'Փ',
				options : ['Փ','փ','Ⴔ','ቁ','ቂ','ቃ','ቄ','ቅ','ቆ','ቇ','ቈ','ᛄ']
			},
			'Х' : {
				selected : 'χ',
				options : ['χ','×','✗','✘','᙭','ჯ','Ẍ','ẍ','ᶍ']
			},
			'Ц' : {
				selected : 'Ա',
				options : ['Ա','ų']
			},
			'Ч' : {
				selected : 'Կ',
				options : ['Կ','կ','੫','Ⴁ','Ӵ','ӵ','Ҹ','ҹ']
			},
			'Ш' : {
				selected : 'ᗯ',
				options : ['ᗯ','ᙡ','ω']
			},
			'Щ' : {
				selected : 'պ',
				options : ['պ','ખ']
			},
			'Ъ' : {
				selected : 'Ѣ',
				options : ['Ѣ','ѣ','৮']
			},
			'Ы' : {
				selected : 'Ӹ',
				options : ['Ӹ','ӹ']
			},
			'Ь' : {
				selected : 'Ѣ',
				options : ['Ѣ','ѣ','৮']
			},
			'Э' : {
				selected : '∋',
				options : ['∋','∌','∍','ヨ','Ӭ','ӭ','℈']
			},
			'Ю' : {
				selected : 'ਠ',
				options : ['ਠ']
			},
			'Я' : {
				selected : 'я',
				options : ['я','Я','Я','я','Я','я']
			},


			'A' : {
				selected : 'Ꭿ',
				options : ['Ꭿ','∀','₳','Ǻ','ǻ','α','ά','Ǡ','Ắ','ắ','Ằ','ằ','ẳ','Ẵ','ẵ','Ä','ª','ä','Å','À','Á','Â','å','ã','â','à','á','Ã','ᗩ','@','Ⱥ','Ǟ']
			},
			'B' : {
				selected : 'ℬ',
				options : ['ℬ','Ᏸ','β','฿','ß','Ђ','ᗷ','ᗽ','ᗾ','ᗿ','Ɓ','ƀ','ხ','␢','Ᏸ','ᗸ','ᗹ','ᛔ']
			},
			'C' : {
				selected : '☾',
				options : ['☾','ℭ','ℂ','Ç','¢','ç','Č','ċ','Ċ','ĉ','ς','Ĉ','ć','Ć','č','Ḉ','ḉ','⊂','Ꮸ','₡','¢','Ⴚ']
			},
			'D' : {
				selected : 'ᗫ',
				options : ['ᗫ','Ɗ','Ď','ď','Đ','đ','ð','∂','₫','ȡ','ᚦ','ᚧ']
			},
			'E' : {
				selected : 'ℰ',
				options : ['ℰ','ℯ','ໂ','६','£','Ē','℮','ē','Ė','ė','Ę','ě','Ě','ę','Έ','ê','ξ','Ê','È','€','É','∑','Ế','Ề','Ể','Ễ','é','è','Є','є','έ','ε','Ҿ','ҿ']
			},
			'F' : {
				selected : 'ℱ',
				options : ['ℱ','₣','ƒ','∮','Ḟ','ḟ','ჶ','ᶂ','φ','ᚨ','ᚩ','ᚪ','ᚫ']
			},
			'G' : {
				selected : 'Ꮹ',
				options : ['Ꮹ','Ꮆ','ℊ','Ǥ','ǥ','Ĝ','ĝ','Ğ','ğ','Ġ','ġ','Ģ','ģ','פ','ᶃ','₲']
			},
			'H' : {
				selected : 'ℍ',
				options : ['ℍ','ℋ','ℎ','ℌ','ℏ','ዙ','Ꮵ','Ĥ','Ħ','ħ','Ή','廾','Ћ','ђ','Ḩ','Һ','ḩ','♄','ਮ']
			},
			'I' : {
				selected : 'ℐ',
				options : ['ℐ','ί','ι','Ï','Ί','Î','ì','Ì','í','Í','î','ϊ','ΐ','Ĩ','ĩ','Ī','ī','Ĭ','ĭ','İ','į','Į','Ꭵ']
			},
			'J' : {
				selected : 'ჟ',
				options : ['ჟ','Ĵ','ĵ','ᶖ','ɉ','ℑ']
			},
			'K' : {
				selected : '₭',
				options : ['₭','Ꮶ','Ќ','k','ќ','ķ','Ķ','Ҝ','ҝ','ᶄ','Ҡ','ҡ']
			},
			'L' : {
				selected : 'ℒ',
				options : ['ℒ','ℓ','Ŀ','ŀ','Ĺ','ĺ','Ļ','ļ','λ','₤','Ł','ł','ľ','Ľ','Ḽ','ḽ','ȴ','Ꮭ']
			},
			'M' : {
				selected : 'ℳ',
				options : ['ℳ','ʍ','ᶆ','Ḿ','ḿ','♍','ᗰ','ᙢ','爪','♏','₥','ጠ','ᛖ']
			},
			'N' : {
				selected : 'ℕ',
				options : ['ℕ','η','ñ','ח','Ñ','ή','ŋ','Ŋ','Ń','ń','Ņ','ņ','Ň','ň','ŉ','ȵ','ℵ','₦','ห','ກ','⋒','Ӈ','ӈ']
			},
			'O' : {
				selected : 'ℴ',
				options : ['ℴ','ტ','٥','Ό','ó','ό','σ','ǿ','Ǿ','Θ','ò','Ó','Ò','Ô','ô','Ö','ö','Õ','õ','ờ','ớ','ọ','Ọ','ợ','Ợ','ø','Ø','Ό','Ở','Ờ','Ớ','Ổ','ổ','Ợ','Ō','ō','Ő','ő']
			},
			'P' : {
				selected : 'ℙ',
				options : ['ℙ','℘','ρ','Ꭾ','Ꮅ','尸','Ҏ','ҏ','ᶈ','₱','☧','ᖘ','ק','₽','թ','Ƿ','Ҏ','ҏ']
			},
			'Q' : {
				selected : 'ℚ',
				options : ['ℚ','q','Q','ᶐ','Ǭ','ǭ','ჹ','૧']
			},
			'R' : {
				selected : 'ℝ',
				options : ['ℝ','ℜ','ℛ','℟','ჩ','ᖇ','ř','Ř','ŗ','Ŗ','ŕ','Ŕ','ᶉ','Ꮢ','尺','ᚱ']
			},
			'S' : {
				selected : 'Ꮥ',
				options : ['Ꮥ','Ṧ','ṧ','ȿ','§','Ś','ś','š','Š','ş','Ş','ŝ','Ŝ','₰','∫','$','ֆ','Տ','క']
			},
			'T' : {
				selected : '₸',
				options : ['₸','†','T','t','τ','Ţ','ţ','Ť','ť','ŧ','Ŧ','干','Ṫ','ṫ','ナ','Ꮏ','Ꮖ','テ','₮','⍡']
			},
			'U' : {
				selected : '∪',
				options : ['∪','ᙀ','Ũ','Ủ','Ừ','Ử','Ữ','Ự','ύ','ϋ','Ù','ú','Ú','ΰ','ù','Û','û','Ü','ử','ữ','ự','ü','ừ','Ũ','ũ','Ū','ū','Ŭ','ŭ','ų','Ų','ű','Ű','ů','Ů','น','Ա']
			},
			'V' : {
				selected : '✔',
				options : ['✔','✓','∨','√','Ꮙ','Ṽ','ṽ','ᶌ','℣']
			},
			'W' : {
				selected : '₩',
				options : ['₩','ẃ','Ẃ','ẁ','Ẁ','ẅ','ώ','ω','ŵ','Ŵ','Ꮤ','Ꮃ','ฬ','ᗯ','ᙡ','Ẅ','ѡ','ಎ','ಭ','Ꮚ','Ꮗ','ผ','ฝ','พ','ฟ']
			},
			'X' : {
				selected : 'ჯ',
				options : ['χ','×','✗','✘','᙭','ჯ','Ẍ','ẍ','ᶍ']
			},
			'Y' : {
				selected : 'ɣ',
				options : ['ɣ','Ꭹ','Ꮍ','Ẏ','ẏ','ϒ','ɤ','￥','௶','Ⴘ']
			},
			'Z' : {
				selected : 'ℤ',
				options : ['ℤ','乙','Ẑ','ẑ','ɀ','Ꮓ']
			},








			'а' : {
				selected : 'Ắ',
				options : ['Ꭿ','₳','Ǻ','ǻ','α','ά','Ǡ','ẫ','Ắ','ắ','Ằ','ằ','ẳ','Ẵ','ẵ','Ä','ª','ä','Å','À','Á','Â','å','ã','â','à','á','Ã','ᗩ','@','Ⱥ','Ǟ']
			},
			'б' : {
				selected : 'Ҕ',
				options : ['Ҕ','ҕ','Ϭ','ϭ','চ','ঢ়','ƃ','ɓ']
			},
			'в' : {
				selected : 'ℬ',
				options : ['ℬ','Ᏸ','β','฿','ß','ᗷ','ᗽ','ᗾ','ᗿ','Ɓ','Ᏸ','ᗸ','ᗹ','ᛔ']
			},
			'г' : {
				selected : '୮',
				options : ['୮','┍','ℾ']
			},
			'д' : {
				selected : 'ℊ',
				options : ['ℊ','∂']
			},
			'е' : {
				selected : 'ℰ',
				options : ['ℰ','ℯ','ໂ','६','Ē','℮','ē','Ė','ė','Ę','ě','Ě','ę','Έ','ê','Ê','È','€','É','Ế','Ề','Ể','Ễ','é','è','Є','є','έ','ε','Ҿ','ҿ']
			},
			'ж' : {
				selected : 'ᛤ',
				options : ['ᛤ','♅','Җ','җ','Ӝ','ӝ','Ӂ','ӂ']
			},
			'з' : {
				selected : 'Յ',
				options : ['Յ','ℨ','ჳ']
			},
			'и' : {
				selected : 'น',
				options : ['น','ự','Ӥ','ӥ']
			},
			'й' : {
				selected : 'Ũ',
				options : ['Ũ','ũ','Ū','ū','Ŭ','ŭ','Ù','ú','Ú','ù','Ҋ','ҋ']
			},
			'к' : {
				selected : 'ᛕ',
				options : ['ᛕ','₭','Ꮶ','Ќ','k','ќ','ķ','Ķ','Ҝ','ҝ','ᶄ','Ҡ','ҡ']
			},
			'л' : {
				selected : 'ለ',
				options : ['ለ','ሉ','ሊ','ሌ','ል','ሎ','Ꮧ','Ꮑ']
			},
			'м' : {
				selected : 'ጠ',
				options : ['ጠ','ᛖ','ℳ','ʍ','ᶆ','Ḿ','ḿ','♍','ᗰ','ᙢ','爪','♏','₥']
			},
			'н' : {
				selected : 'ਮ',
				options : ['ਮ','ዘ','ዙ','ዚ','ዛ','ዜ','ዝ','ዞ','ዟ','ℍ','ℋ','ℎ','ℌ','ℏ','ዙ','Ꮵ','Ĥ','Ħ','Ή','Ḩ','Ӈ','ӈ']
			},
			'о' : {
				selected : '০',
				options : ['০','ℴ','ტ','٥','Ό','ó','ό','σ','ǿ','Ǿ','Θ','ò','Ó','Ò','Ô','ô','Ö','ö','Õ','õ','ờ','ớ','ọ','Ọ','ợ','Ợ','ø','Ø','Ό','Ở','Ờ','Ớ','Ổ','ổ','Ợ','Ō','ō','Ő','ő','Ӫ','ӫ']
			},
			'п' : {
				selected : 'Ո',
				options : ['Ո','ग','ກ','⋒','Ҧ','ҧ']
			},
			'р' : {
				selected : 'թ',
				options : ['թ','ℙ','℘','ρ','Ꭾ','Ꮅ','尸','Ҏ','ҏ','ᶈ','₱','☧','ᖘ','ק','₽','Ƿ','Ҏ','ҏ']
			},
			'с' : {
				selected : 'Ⴚ',
				options : ['Ⴚ','☾','ℭ','ℂ','Ç','¢','ç','Č','ċ','Ċ','ĉ','ς','Ĉ','ć','Ć','č','Ḉ','ḉ','⊂','Ꮸ','₡','¢']
			},
			'т' : {
				selected : '⍑',
				options : ['⍑','⍡','T','t','τ','Ţ','Ť','Ŧ','Ṫ','₮']
			},
			'у' : {
				selected : 'ɣ',
				options : ['ɣ','Ꭹ','Ꮍ','Ẏ','ẏ','ϒ','ɤ','￥','௶','Ⴘ']
			},
			'ф' : {
				selected : 'Փ',
				options : ['Փ','փ','Ⴔ','ቁ','ቂ','ቃ','ቄ','ቅ','ቆ','ቇ','ቈ','ᛄ']
			},
			'х' : {
				selected : 'χ',
				options : ['χ','×','✗','✘','᙭','ჯ','Ẍ','ẍ','ᶍ']
			},
			'ц' : {
				selected : 'Ա',
				options : ['Ա','ų']
			},
			'ч' : {
				selected : 'Կ',
				options : ['Կ','կ','੫','Ⴁ','Ӵ','ӵ','Ҹ','ҹ']
			},
			'ш' : {
				selected : 'ᗯ',
				options : ['ᗯ','ᙡ','ω']
			},
			'щ' : {
				selected : 'պ',
				options : ['պ','ખ']
			},
			'ъ' : {
				selected : 'Ѣ',
				options : ['Ѣ','ѣ','৮']
			},
			'ы' : {
				selected : 'Ӹ',
				options : ['Ӹ','ӹ']
			},
			'ь' : {
				selected : 'Ѣ',
				options : ['Ѣ','ѣ','৮']
			},
			'э' : {
				selected : '∋',
				options : ['∋','∌','∍','ヨ','Ӭ','ӭ','℈']
			},
			'ю' : {
				selected : 'ਠ',
				options : ['ਠ']
			},
			'я' : {
				selected : 'я',
				options : ['я','Я','Я','я','Я','я']
			},



			'a' : {
				selected : 'Ꭿ',
				options : ['Ꭿ','∀','₳','Ǻ','ǻ','α','ά','Ǡ','Ắ','ắ','Ằ','ằ','ẳ','Ẵ','ẵ','Ä','ª','ä','Å','À','Á','Â','å','ã','â','à','á','Ã','ᗩ','@','Ⱥ','Ǟ']
			},
			'b' : {
				selected : 'ℬ',
				options : ['ℬ','Ᏸ','β','฿','ß','Ђ','ᗷ','ᗽ','ᗾ','ᗿ','Ɓ','ƀ','ხ','␢','Ᏸ','ᗸ','ᗹ','ᛔ']
			},
			'c' : {
				selected : '☾',
				options : ['☾','ℭ','ℂ','Ç','¢','ç','Č','ċ','Ċ','ĉ','ς','Ĉ','ć','Ć','č','Ḉ','ḉ','⊂','Ꮸ','₡','¢','Ⴚ']
			},
			'd' : {
				selected : 'ᗫ',
				options : ['ᗫ','Ɗ','Ď','ď','Đ','đ','ð','∂','₫','ȡ','ᚦ','ᚧ']
			},
			'e' : {
				selected : 'ℰ',
				options : ['ℰ','ℯ','ໂ','६','£','Ē','℮','ē','Ė','ė','Ę','ě','Ě','ę','Έ','ê','ξ','Ê','È','€','É','∑','Ế','Ề','Ể','Ễ','é','è','Є','є','έ','ε','Ҿ','ҿ']
			},
			'f' : {
				selected : 'ℱ',
				options : ['ℱ','₣','ƒ','∮','Ḟ','ḟ','ჶ','ᶂ','φ','ᚨ','ᚩ','ᚪ','ᚫ']
			},
			'g' : {
				selected : 'Ꮹ',
				options : ['Ꮹ','Ꮆ','ℊ','Ǥ','ǥ','Ĝ','ĝ','Ğ','ğ','Ġ','ġ','Ģ','ģ','פ','ᶃ','₲']
			},
			'h' : {
				selected : 'ℍ',
				options : ['ℍ','ℋ','ℎ','ℌ','ℏ','ዙ','Ꮵ','Ĥ','Ħ','ħ','Ή','廾','Ћ','ђ','Ḩ','Һ','ḩ','♄','ਮ']
			},
			'i' : {
				selected : 'ℐ',
				options : ['ℐ','ί','ι','Ï','Ί','Î','ì','Ì','í','Í','î','ϊ','ΐ','Ĩ','ĩ','Ī','ī','Ĭ','ĭ','İ','į','Į','Ꭵ']
			},
			'j' : {
				selected : 'ჟ',
				options : ['ჟ','Ĵ','ĵ','ᶖ','ɉ','ℑ']
			},
			'k' : {
				selected : '₭',
				options : ['₭','Ꮶ','Ќ','k','ќ','ķ','Ķ','Ҝ','ҝ','ᶄ','Ҡ','ҡ']
			},
			'l' : {
				selected : 'ℒ',
				options : ['ℒ','ℓ','Ŀ','ŀ','Ĺ','ĺ','Ļ','ļ','λ','₤','Ł','ł','ľ','Ľ','Ḽ','ḽ','ȴ','Ꮭ']
			},
			'm' : {
				selected : 'ℳ',
				options : ['ℳ','ʍ','ᶆ','Ḿ','ḿ','♍','ᗰ','ᙢ','爪','♏','₥','ጠ','ᛖ']
			},
			'n' : {
				selected : 'ℕ',
				options : ['ℕ','η','ñ','ח','Ñ','ή','ŋ','Ŋ','Ń','ń','Ņ','ņ','Ň','ň','ŉ','ȵ','ℵ','₦','ห','ກ','⋒','Ӈ','ӈ']
			},
			'o' : {
				selected : 'ℴ',
				options : ['ℴ','ტ','٥','Ό','ó','ό','σ','ǿ','Ǿ','Θ','ò','Ó','Ò','Ô','ô','Ö','ö','Õ','õ','ờ','ớ','ọ','Ọ','ợ','Ợ','ø','Ø','Ό','Ở','Ờ','Ớ','Ổ','ổ','Ợ','Ō','ō','Ő','ő']
			},
			'p' : {
				selected : 'ℙ',
				options : ['ℙ','℘','ρ','Ꭾ','Ꮅ','尸','Ҏ','ҏ','ᶈ','₱','☧','ᖘ','ק','₽','թ','Ƿ','Ҏ','ҏ']
			},
			'q' : {
				selected : 'ℚ',
				options : ['ℚ','q','Q','ᶐ','Ǭ','ǭ','ჹ','૧']
			},
			'r' : {
				selected : 'ℝ',
				options : ['ℝ','ℜ','ℛ','℟','ჩ','ᖇ','ř','Ř','ŗ','Ŗ','ŕ','Ŕ','ᶉ','Ꮢ','尺','ᚱ']
			},
			's' : {
				selected : 'Ꮥ',
				options : ['Ꮥ','Ṧ','ṧ','ȿ','§','Ś','ś','š','Š','ş','Ş','ŝ','Ŝ','₰','∫','$','ֆ','Տ','క']
			},
			't' : {
				selected : '₸',
				options : ['₸','†','T','t','τ','Ţ','ţ','Ť','ť','ŧ','Ŧ','干','Ṫ','ṫ','ナ','Ꮏ','Ꮖ','テ','₮','⍡']
			},
			'u' : {
				selected : '∪',
				options : ['∪','ᙀ','Ũ','Ủ','Ừ','Ử','Ữ','Ự','ύ','ϋ','Ù','ú','Ú','ΰ','ù','Û','û','Ü','ử','ữ','ự','ü','ừ','Ũ','ũ','Ū','ū','Ŭ','ŭ','ų','Ų','ű','Ű','ů','Ů','น','Ա']
			},
			'v' : {
				selected : '✔',
				options : ['✔','✓','∨','√','Ꮙ','Ṽ','ṽ','ᶌ','℣']
			},
			'w' : {
				selected : '₩',
				options : ['₩','ẃ','Ẃ','ẁ','Ẁ','ẅ','ώ','ω','ŵ','Ŵ','Ꮤ','Ꮃ','ฬ','ᗯ','ᙡ','Ẅ','ѡ','ಎ','ಭ','Ꮚ','Ꮗ','ผ','ฝ','พ','ฟ']
			},
			'x' : {
				selected : 'χ',
				options : ['χ','×','✗','✘','᙭','ჯ','Ẍ','ẍ','ᶍ']
			},
			'y' : {
				selected : 'ɣ',
				options : ['ɣ','Ꭹ','Ꮍ','Ẏ','ẏ','ϒ','ɤ','￥','௶','Ⴘ']
			},
			'z' : {
				selected : 'ℤ',
				options : ['ℤ','乙','Ẑ','ẑ','ɀ','Ꮓ']
			},
		},
	},
	watch : {
		input_text : function(){
			this.convert();
		},
		symbols : function(){
			this.convert();
		},
	},
	created : function(){
		this.convert();
	},
	updated : function(){
		this.convert();
	},
	methods : {
		convert : function() {
			let text = '';
			for (let i = 0, len = this.input_text.length; i < len; i++) {
				if (this.symbols[this.input_text[i]]) {
					text += this.symbols[this.input_text[i]].selected;
				} else {
					text += this.input_text[i];
				}
			}

			this.output_text = text;

		},
	},
});